Revit 2027 API
BuiltInFailures.FamilyFailures.ColumnAlreadyAttachedWillBeReattached Property
 The column is already attached. It will be detached and attached to the new target.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ColumnAlreadyAttachedWillBeReattached { get; }
Public Shared ReadOnly Property ColumnAlreadyAttachedWillBeReattached As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ColumnAlreadyAttachedWillBeReattached {
	FailureDefinitionId^ get ();
}
static member ColumnAlreadyAttachedWillBeReattached : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace